import os
import time
a=input("Укажите в каких измерениях (с-секунды, м-минуты, ч-часы, д-дни): ")
b=int(input("Укажите число: "))
c=0
print("\n")

if a=="м":
	b=b*60
elif a=="ч":
	b=b*60*60
elif a=="д":
	b=b*60*60*24

while c < b:
	c+=1
	d=b-c
	os.system('clear')
	print(str(c) + " секунд прошло, цель " + str(b) + " секунд, осталось " + str(d) + " секунд.")
	time.sleep(1)
if b < 60:
	print("\n" + str(b) + " секунд прошло, задача окончена!")
elif b < 3600:
	print("\n" + str(b/60) + " минут прошло, задача окончена!")
elif b<86400:
	print("\n" + str(b/3600) + " часов прошло, задача окончена!")
elif b>=86400:
	print("\n" + str(b/86400) + " дней прошло, задача окончена!")